/**
 * Сложность -2-1(от минус двух до 1)😅
 * Задача: Форматирование числа
 *
 * Напишите функцию, которая принимает число и возвращает строку, где это число отформатировано так, как стандартная запись числа в Северной Америке: каждые 3 цифры справа разделены запятой.
 *
 * @param {number} num - Число для форматирования.
 * @returns {string} - Отформатированная строка числа.
 *
 * Примеры:
 * solution(1238592); // Должно вернуть "1,238,592"
 * solution(1);       // Должно вернуть "1"
 * solution(10);      // Должно вернуть "10"
 * solution(150);     // Должно вернуть "150"
 * solution(1234);    // Должно вернуть "1,234"
 * solution(15075);   // Должно вернуть "15,075"
 * solution(123456);  // Должно вернуть "123,456"
 */


const solution = (num) => {
  return '';
};


module.exports = solution;
