/**
 * Сложность -1🤣
 * Задача: Найти индекс первого вхождения строки
 * Напишите функцию, которая принимает две строки и возвращает индекс первого вхождения второй строки
 * в первую строку. Если вторая строка не найдена, верните -1.
 *
 * @param {string} first - Первая строка.
 * @param {string} second - Вторая строка, нужно найти где она располагается в первой.
 * @returns {number} - Индекс первого вхождения второй строки в первую строку или -1, если не найдено.
 *
 * Примеры:
 * solution('some str', 'st')  // Должно вернуть 5
 * solution('some str', '11')  // Должно вернуть -1
 * solution('some str', 'ome') // Должно вернуть 1
 * solution('test', 't')       // Должно вернуть 0
 */

const solution = (first, second) => {
  return 0;
};

module.exports = solution;
