// Задача: Расстояние через реку


// У вас есть лодка, которая пересекает реку. Необходимо вычислить расстояние,
// которое лодка проходит через реку, учитывая ширину реки, скорость лодки,
// перпендикулярную реке, и скорость реки. Необходимо использовать округление в большую сторону.

// Примеры:
// solution(3, 6, 8) должна вернуть 5
// solution(10, 10, 0) должна вернуть 10
// solution(4, 3, 2) должна вернуть 5


/**
 * Рассчитывает время, через которое два поезда встретятся.
 * @param {number} width - ширина реки.
 * @param {number} boatSpeed - скорость лодки, перпендикулярно реке.
 * @param {number} riverSpeed - скорость реки.
 * @returns {number} Функция должна вернуть расстояние, округленное в большую сторону.
 */

const solution = (width, boatSpeed, riverSpeed) => {
	return 0;
}

module.exports = solution;
