/**
 * Задача: Создание массива с четными и нечетными числами
 *
 * Напишите функцию, которая создает новый массив, содержащий нечетные числа с нечетными индексами и четные числа с четными индексами из данного массива.
 * Если таких чисел нет, верните [0].
 *
 * @param {number[]} arr - Исходный массив чисел.
 * @returns {number[]} - Новый массив.
 *
 * Примеры:
 * solution([1,2,3]);                 // Должно вернуть [0]
 * solution([1,3,2,5,5]);             // Должно вернуть [3,2,5]
 * solution([1,2,3,3,5,6,6]);         // Должно вернуть [3,6]
 * solution([1,3,1,6,9,11,13,15,16]); // Должно вернуть [3,11,15,16]
 * solution([0,1,2,3,4]);             // Должно вернуть [0,1,2,3,4]
 */

const solution = (numbers) => {
	return  [0];
};

module.exports = solution;
