/**
 * Сложность 1.2
 * Задача: Образуйте наибольшее возможное число
 *
 * Напишите функцию, которая принимает массив чисел и возвращает наибольшее возможное число, которое можно получить, объединив числа из массива.
 *
 * @param {number[]} numbers - Массив чисел.
 * @returns {string} - Наибольшее возможное число в виде строки.
 *
 * Примеры:
 * solution([1,34,3,98,9,76,45,4]);   // Должно вернуть "998764543431"
 * solution([1,2,3,4,5,6]);          // Должно вернуть "654321"
 * solution([481,428,385,202,2,197,106,10]); // Должно вернуть "481428385220219710610"
 * solution([54,546,548,60]);       // Должно вернуть "6054854654"
 * solution([43,44,12,324,90,9,88,89]);   // Должно вернуть "9908988444332412"
 * solution([1]);                   // Должно вернуть "1"
 * solution([1,1]);                 // Должно вернуть "11"
 * solution([1,2,223]);             // Должно вернуть "22321"
 */

const solution = (numbers) => {
  return '0';
};

module.exports = solution;
