/**
 * Сложность -2😅
 * Задача: Форматировать настроение
 * 
 *
 * Напишите функцию, которая принимает текущее настроение и возвращает отформатированную строку,
 * как указано в тестах.
 *
 * @param {string} mood - Текущее настроение.
 * @returns {string} - Отформатированная строка настроения.
 *
 * Примеры:
 * solution("")        // Должно вернуть "Today, I am feeling neutral."
 * solution("happy")   // Должно вернуть "Today, I am feeling happy."
 * solution("sad")     // Должно вернуть "Today, I am feeling sad."
 * solution("good")    // Должно вернуть "Today, I am feeling good."
 * solution("excited") // Должно вернуть "Today, I am feeling excited."
 * solution("confused")// Должно вернуть "Today, I am feeling confused."
 */

const solution = (mood) => {
	return '';
};

module.exports = solution;
