/**
 * Сложность 1🤣🤣😂🤣
 * Задача: Номер столбца Excel
 *
 * Напишите функцию, которая принимает имя столбца Excel и возвращает соответствующий номер этого столбца.
 *
 * @param {string} columnTitle - Имя столбца Excel.
 * @returns {number} - Номер столбца.
 *
 * Примеры:
 * solution("YP");   // Должно вернуть 666
 * solution("Z");    // Должно вернуть 26
 * solution("A");    // Должно вернуть 1
 * solution("CPN");  // Должно вернуть 2458
 * solution("AJHX"); // Должно вернуть 24568
 */

const solution = (columnTitle) => {
  return 0;
};

module.exports = solution;
