/**
 * Задача: Найти четные числа с четными индексами
 *
 * Напишите функцию, которая принимает массив чисел и возвращает новый массив, содержащий четные числа с четными индексами.
 * Если таких чисел нет, верните [0].
 *
 * @param {number[]} nums - Массив чисел.
 * @returns {number[]} - Новый массив с четными числами с четными индексами.
 *
 * Примеры:
 * solution([1,2,3]);       // Должно вернуть [0]
 * solution([1,2,2,4,5]);   // Должно вернуть [2]
 * solution([1,3,2,6,4,8]); // Должно вернуть [2,4]
 * solution([0,1,2,3,4]);   // Должно вернуть [0,2,4]
 */

const solution = (nums) => {
  return [0];
};

module.exports = solution;
