/**
 * Сложность -1
 * Задача: Рассчитать площадь треугольника по формуле Герона.
 * p = (a + b + c) / 2
 * s = √(p * (p - a) * (p - b) * (p - c))
 * Результат округлить в меньшую строну
 * 
 * Функция принимает длины сторон треугольника (a, b, c) и возвращает округлённую площадь треугольника.
 *
 * @param {number} a - Длина стороны a.
 * @param {number} b - Длина стороны b.
 * @param {number} c - Длина стороны c.
 *
 * Примеры:
 * solution(24, 30, 18); // Должно вернуть 216
 * solution(14, 10, 12); // Должно вернуть 58
 * solution(-14, -10, -12); // Должно вернуть 58
 */

const solution = (a, b, c) => {
	return 0;
};

module.exports = solution;
