/**
 * Задача: Подсчет повторений элементов в массиве.
 * Необходимо подсчитать колличество каждого элемента в массиве и отсортировать по алфавиту в нижнем регистре
 * данные записать в обект в фармате {
 *   [элемент]: колличество, 
 * }
 *
 * @param {string[]} arr - Исходный массив.
 * @returns {Object} - Ассоциативный массив с количеством повторений элементов.
 * 
 * Примеры:
 * solution(["canvas","humor","side","tax"]);             // Должно вернуть {"canvas":1,"humor":1,"side":1,"tax":1}
 * solution(["Spam","Spam","Spam","Spam","bacon","egg"]); // Должно вернуть {"bacon":1,"egg":1,"spam":4}}
 */

const solution = (arr) => {
  const result = {};
  return result;
};

module.exports = solution;
